#+TODO: TODO(t) BUG IDEA IMPROV | DONE(d!) FIXED DESISTIDO
* Monica-
** Mercaderia llevada de oficina [9/12]
*** DONE 2 pack de toallones nauticos
*** DONE 1 cortina turquesa
*** DONE 1 pb2 rombitos turquesa
*** DONE 1 lh2 devuelta por Figueroa Mirta
*** DONE [2017-09-18 lun] pack toallones
- State "DONE"       from "BUG"        [2017-09-20 mié 14:16]
64184
*** DONE [2017-09-18 lun] pack toallones
- State "DONE"       from "TODO"       [2017-09-25 lun 11:43]
64240
*** DONE [2017-09-25 lun] mantel
- State "DONE"       from "TODO"       [2017-09-28 jue 16:45]
64352
*** DONE [2017-09-25 lun] mantel
- State "DONE"       from "TODO"       [2017-09-28 jue 16:45]
64351
*** DONE [2017-09-28 jue] cortina incaica
- State "DONE"       from "TODO"       [2017-10-03 mar 14:32]
64452
*** TODO [2017-10-03 mar] pack toallones reducido
*** TODO [2017-10-03 mar] pack toallones reducido
*** TODO [2017-10-03 mar] mantel chocolate
- Dejada por Fede [2017-09-18 lun] [19/21]
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:44]
64239
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:44]
64238
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:44]
64237
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:45]
64236 parte 1
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:45]
64236 parte 2
*** DONE cocina tropical
- State "DONE"       from "TODO"       [2017-09-25 lun 11:47]
64233
*** DONE cocina tropical
- State "DONE"       from "TODO"       [2017-09-25 lun 11:48]
64232
*** DONE cortina
- State "DONE"       from "TODO"       [2017-09-20 mié 14:17]
64185
*** DONE cortina
- State "DONE"       from "TODO"       [2017-09-25 lun 11:47]
64235
*** DONE cortina
- State "DONE"       from "TODO"       [2017-09-25 lun 11:48]
64231
*** DONE cortina
- State "DONE"       from "TODO"       [2017-09-28 jue 16:45]
64352
*** DONE cortina
- State "DONE"       from "TODO"       [2017-10-03 mar 14:32]
64452
*** TODO cortina
*** DONE mantel cuerina
- State "DONE"       from "TODO"       [2017-09-25 lun 11:48]
64233
*** TODO mantel cuerina
*** DONE PB2
- State "DONE"       from "TODO"       [2017-09-20 mié 14:17]
64183
*** DONE PB2
- State "DONE"       from "TODO"       [2017-10-03 mar 14:31]
64453
*** DONE PB1
- State "DONE"       from "TODO"       [2017-09-25 lun 11:47]
64234
*** DONE PB1
- State "DONE"       from "TODO"       [2017-10-03 mar 14:31]
64453
*** DONE piñata
- State "DONE"       from "TODO"       [2017-09-25 lun 11:48]
64231
*** DONE piñata
- State "DONE"       from "TODO"       [2017-10-03 mar 14:32]
64453
** Entregado con su pack de toallones que le debemos
*** DONE pack nautico
- State "DONE"       from "TODO"       [2017-09-25 lun 11:46]
64235 
** quedamos que los packs de muestra iran a 6x160
* Elva
** DONE sab pb2 torres
- State "DONE"       from "TODO"       [2017-09-26 mar 10:48]
** DONE SOTO LORENA SOLEDAD 3518010272 que llame y quede de acuerdo
SCHEDULED: <2017-10-02 lun>
- State "DONE"       from "TODO"       [2017-09-29 vie 15:07]
para cobrar y llevar una sabana, se mudo a guido y europa.



* Llamados pidiendo mercaderia no pasados a BD
** Comptom 5381 Dora ludueña cortinas[2017-09-12 mar]
** DONE [2017-09-13 mié] caso Tolosa 737 Maldonado Beatriz
Heredia Valeria y Micaela Villalba morosas en seven, no se puede
entregar nada ahi.


* DONE Devoluciones pendientes con Fede en zona [1/1]
- State "DONE"       from "TODO"       [2017-09-22 vie 10:54]
** DONE devolucion Mna 13 casa 36 Ampliacion Cabildo
- State "DONE"       from "IDEA"       [2017-09-22 vie 10:54]
al otro dia retiro la sabana y dejo la cortina en la casa.

* LLamados por reclamos de sabanas
** [2017-09-15 vie] Viviana Romera Vigil 486
disconforme con la sabana LH, no pude hablar pq estaba con los chicos
y ya la uso, le dije que no se podia hacer nada. Dice que iba a ir a
Def Cons, le dije que no lo diga que lo haga (tipo pope). y fresco.
** 
* Devoluciones en proceso por cobradores
** TODO [2017-09-15 vie] Viale Melian 2074  cobr 750
** TODO [2017-09-15 vie] Sarmiento Leviller 1535 cobr 755
la atendio la hija y dice que la madre no la iba a querer o que la
habia devuelto creia, una 76.
** DONE [2017-09-18 lun] Charafedin Pall Mall 3714 (cortinas)
- State "DONE"       from "IDEA"       [2017-09-22 vie 10:53]
* Casos sabanas LH estropeadas
** DONE caso Villa el libertador
- State "DONE"       from "TODO"       [2017-09-22 vie 10:51]
1 plaza / se cambio por una falla en la tela, la clienta con muy buena
actitud, incluso la dio pagando la cuota y confiando en el
cobrador. Valia la pena conservar la clienta. La sabana la vendimos
mas barata con la Monica en cuotas creo que 6x80
** TODO Capilla Remedios 6396
1 plaza / se retirara y se anulara la venta. El cobrador dice que esta
desteñida, no vale la pena conservar el cliente alli.



* Recibos sospechosos 765
| [2017-09-22 vie] | 250025 | 63172 | 250 |
|                  |        |       |     |

* bugs a controlar/arreglar
** ver si los planes de mas de 7 cuotas salen semanales


* TODO bugs o improvs fichaje.py [4/32]

** DONE sacar la traba en sexo de pedidos               :tabPedidos:URGENTE:
- State "DONE"       from "TODO"       [2017-10-04 mié 11:32]
** TODO sacar el balloon de nombre de promotor que es molesto   :tabPedidos:
** TODO BUG: cuando anulas una venta que tiene recibo no borra el recibo ojo :tabPasarVentas:
y luego la pasas de nuevo y te figura dos cuotas pagadas
** TODO cuando pones ingresar nuevo y el cursor va a idpedido no se ve :tabPasarVentas:
y confunde un poco y uno tiende a llevar el raton alla al pedo,
colorear???
*** TODO que poner el focus en idpedido sea igual que ingresar nuevo
** TODO cuando pones repetir cliente poner la fecha de la ultima venta- :tabPasarVentas:
tambien vdor 15 y 6 cuotas y fecha primera del ultimo venta 
** BUG pmovto null -- la cuenta no sale
tuve que actualizar a mano como unas 30 cuentas que no se estuvieron
cobrando durante los dos meses anteriores por culpa de este
asunto. Incluso no todas fueron cuentas nuevas y no pude averiguar
cual habia sido la causa.
** TODO hacer un atajo para hacer upper el contenido de un campo
** TODO reubicar botones para mayor ergonomia               :tabPasarVentas:
** IDEA en Fechar arriba de msgcobrar botones "Cancela" "Abona 2 cuotas" etc  lo que usualmente dicen
** IDEA Fechar: fechado por lote, o sea seleccionar dos o tres y fechar a la misma fecha
** TODO Resumen: explorar la posibilidad de incluir fecha pmovto y msgcobrador
eso daria la posibilidad de leer rapidamente en el resumen lo que hay
que hacer o remarcar.
** TODO una pestaña en Pedidos para ver los pedidos hechos por los promotores aun se hayan ido
incluso que me permita buscar un promotor no solo por numero sino por
nombre para el futuro en futuros avisos y que esten todos y me muestre
lo que vendio y cobro ese promotor.
** IDEA que pmovto/pmovto se pongan en rojo o se resalten con valores anomalos :tabPasarRecibos:
entonces no me saco los ojos al pedo mirandolos al vicio si saltan a
un valor normal.
** IDEA el Num de rbo tendria que ir primero que el num de cuenta :tabPasarRecibos:
** IDEA poner los bind a +- a los esearch numericos si se puede.
** BUG cuando procesas una planilla de rbos poner a cero viaticos :tabPasarRecibos:
pq sino da a error en la proxima que vamos a creer que ya estan
descontados los viaticos.
** BUG el "en calle ahora" tiene que tomar hecho=0 y cobr no null   :tabVer:
y en realidad siempre van a haber dos recorridos no hechos asi que ahi
tiene que ser el max()
** BUG en el subtab Planillas de asientos al abrir no se recalcula :tabPasarRecibos:
el tbls de abajo que tiene las planillas en moradito
** DESISTIDO que los tbls tengan un bind que te diga el nombre intenro del tbls :tablelist:
lo que seria util para los bugs y las correcciones
CLOCK: [2017-10-04 mié 18:12]--[2017-10-04 mié 18:38] =>  0:26
tiempo perdido tratando de hacer un metodo general para que los
tablelist muestren su nombre directamente no se puede pq no hay forma
que dentro de la clase se sepa cual es el nombre que le das a la instancia.
** BUG cuando elegis un cliente y abris el popup  salta error con self.saldo :tabPasarRecibos:
pq no hay una cuenta correcta ahi y se genera el evento FocusOut y da
error, habria que hacer un if ahi
** IMPROV en pasar planilla hacer un ballon que diga que ya esta pasada y evite el error :tabPasarRecibos:
** IDEA que los recibos se autonumeren con el num siguiente del lboxrbos :tabPasarRecibos:
** BUG se rompio ver en Fechar desde ver cliente directamente        :tabVer:
** IMPROV que frenen los botones en pedidos en pasar cliente     :tabPedidos:
** IMPROV que el balloon de frenado en pedidos no tape el num de pedido :tabPedidos:
** IMPROV boton purgar para listado rbos                    :tabPasarRecibos:
** TODO faltaria impresor de planos desde dentro del sistema     :Generales:
pero no por tenerlo en base de datos sino por disparado externo por
pdf, pq es muy tedioso buscar el plano abrirlo etc.
** DONE el tbl moradito de planillas es un desastre id ordena mal, no tiene colspesos no recalcula etc :tabPasarRecibos:
- State "DONE"       from "BUG"        [2017-10-04 mié 18:50]
CLOCK: [2017-10-04 mié 18:43]--[2017-10-04 mié 18:50] =>  0:07
arreglado orden de columna id, colspesos
** DONE en tbl loterbos la cnt la llena mal pq a todos pone 50 :tabPasarRecibos:
- State "DONE"       from "BUG"        [2017-10-04 mié 18:12]
CLOCK: [2017-10-04 mié 18:00]--[2017-10-04 mié 18:11] =>  0:11
listo era que ponia len(w) donde w era el set de 50 entrys, por eso
daba 50 siempre. Ahora lo calcule con sqlite.
** TODO hacer que cobradores puntaje sea un campo          :tabPasarRecibos:
** TODO atajo para imprimir una sola ficha desde tabVer por mas vieja que sea :tabVer:
** TODO sacar pestaña recibos vieja
* Preguntar Fede
** DONE pedir queen!!
SCHEDULED: <2017-09-21 jue>
- State "DONE"       from "TODO"       [2017-09-20 mié 22:00]

** DONE plantear que Lesta aclare que LH son microfibra
SCHEDULED: <2017-09-21 jue>
- State "DONE"       from "IDEA"       [2017-09-21 jue 14:55]



* Tareas
** DONE Revisar si todas las planillas de promotores estan pasadas a pc
SCHEDULED: <2017-09-22 vie>
- State "DONE"       from "IDEA"       [2017-09-22 vie 14:18]
eso explicaria la diferencia.
encontre que falime y daniela no estaban pasados, por casi 11k y vales
por 1k mas.
Hice un formato condicional para que use dos cuentas vales promotores
y liquidaciones promotores por el momento y se me facilite las cosas.
** DONE imprimir fichas elva de ventas nuevas
SCHEDULED: <2017-09-21 jue>
- State "DONE"       from "TODO"       [2017-09-21 jue 19:44]
** DONE comprar carpetas 12
SCHEDULED: <2017-09-22 vie>
- State "DONE"       from "TODO"       [2017-09-22 vie 17:36]
** DONE poner aviso  
SCHEDULED: <2017-09-22 vie>
- State "DONE"       from "TODO"       [2017-09-22 vie 17:36]


* llamados 
** Georgia 6389 jueves esta de franco sino al lado vive el hermano
